app/views/chefs/index.html.erb

          <li class="chef-title"> <%= link_to chef.chefname.capitalize, chef_path(chef) %> </li>
          <li> <small> <%= pluralize(chef.recipes.count, "recipes") if chef.recipes %> </small> </li>
---
SELECT COUNT(*) FROM "recipes" WHERE "recipes"."chef_id" = ?  [["chef_id", 298486374]]