app/controllers/chefs_controller.rb

SELECT "chefs".* FROM "chefs" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "chefs"
---
  def index
    @chefs = Chef.paginate(page: params[:page], per_page: 5)

INSERT INTO "chefs" ("chefname", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)  [["chefname", "mashrur"], ["email", "mashrur@example.com"], ["created_at", "2023-01-23 06:36:31.053272"], ["updated_at", "2023-01-23 06:36:31.053272"], ["password_digest", "[FILTERED]"]]
---
  def create
    @chef = Chef.new(chef_params)
    if @chef.save

SELECT "recipes".* FROM "recipes" WHERE "recipes"."chef_id" = ? ORDER BY "recipes"."updated_at" DESC LIMIT ? OFFSET ?  [["chef_id", 980190963], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "recipes" WHERE "recipes"."chef_id" = ?  [["chef_id", 980190963]]
---
  def show
    #@chef=Chef.find(params[:id])
    @chef_recipes= @chef.recipes.paginate(page: params[:page], per_page: 5)

UPDATE "chefs" SET "chefname" = ?, "email" = ?, "updated_at" = ? WHERE "chefs"."id" = ?  [["chefname", "mashrur1"], ["email", "mashrur1@example.com"], ["updated_at", "2023-01-23 08:15:08.904726"], ["id", 980190963]]
---
  def update
    #@chef=Chef.find(params[:id])
    if @chef.update(chef_params)

DELETE FROM "chefs" WHERE "chefs"."id" = ?  [["id", 980190964]]
---
  def destroy
    #@chef=Chef.find(params[:id])
    if !chef.admin?
    @chef.destroy

SELECT "chefs".* FROM "chefs" WHERE "chefs"."id" = ? LIMIT ?  [["id", 980190964], ["LIMIT", 1]]
---
    def set_chef
      @chef=Chef.find(params[:id])