app/controllers/sessions_controller.rb

SELECT "chefs".* FROM "chefs" WHERE "chefs"."email" = ? LIMIT ?  [["email", " "], ["LIMIT", 1]]
---
  def create
  chef = Chef.find_by(email: params[:session][:email].downcase)